#Pthn_hmwrk_two
# 1) Создать 2 переменных типа String с разными значениями
audi = "5"
bmw = "10"
# print(audi, bmw)

#2) Создать 4 переменных типа Integer с разными значениями

